CORPORATE_BOND_RULE = {
    "资产受限": {
        "description": "1.资产被查封、扣押或者冻结\n2.抵押、质押资产\n3.用户选中提取字段后，可通过操作栏画框重新提取答案，重新提取成功后需删除AI推荐答案\n4.修改数字类型提取答案，请注意将修改后答案单位转换为（万元）",
        "formula": [
            # {
            #     "name": "公式1.1",
            #     "data": "$\\frac{\\text{单项资产受限金额}}{\\text{往期年报所有者权益金额}} > 10\\%$",
            # },
            {
                "name": "公式1.1",
                "data": "$\\frac{(\\text{本期年报（半年报）资产受限金额合计}-\\text{往期年报资产受限金额合计})}{\\text{往期年报所有者权益金额}} > 30\\%$",
            },
        ],
    },
    "新增借款": {
        "description": "1.发行人新增借款单笔金额超过上年未净资产20%，或者发行人及其子公司新增借款季末余额每超过上年末净资产50%\n2.用户选中提取字段后，可通过操作栏画框重新提取答案，重新提取成功后需删除AI推荐答案\n3.修改数字类型提取答案，请注意将修改后答案单位转换为（万元）",
        "formula": [
            # {
            #     "name": "公式2.1",
            #     "data": "$\\frac{\\text{单笔借款金额}}{\\text{往期年报所有者权益金额}} > 20\\%$",
            # },
            {
                "name": "公式2.1",
                "data": "$\\frac{(\\text{本期年报（半年报）报告期末有息债务余额}-\\text{往期年报报告期末有息债务余额})}{\\text{往期年报所有者权益金额}} > 50\\%$",
            },
            {
                "name": "公式2.2",
                "data": "$\\frac{(\\text{本期年报（半年报）报告期末有息债务余额}-\\text{本期年报（半年报）报告期初有息债务余额})}{\\text{往期年报所有者权益金额}} > 50\\%$",
            },
        ],
    },
    "对外担保": {
        "description": "1.对外提供保证担保，或者承担流动性支持、差额补足义务等以自身信用对外提供增信\n2.用户选中提取字段后，可通过操作栏画框重新提取答案，重新提取成功后需删除AI推荐答案\n3.修改数字类型提取答案，请注意将修改后答案单位转换为（万元）",
        "formula": [
            # {
            #     "name": "公式3.1",
            #     "data": "$\\frac{\\text{单笔对外担保金额}}{\\text{往期年报所有者权益金额}} > 20\\%$",
            # },
            {
                "name": "公式3.1",
                "data": "$\\frac{(\\text{本期年报（半年报）报告期末对外担保余额}-\\text{往期年报报告期末对外担保余额})}{\\text{往期年报所有者权益金额}} > 50\\%$",
            },
            {
                "name": "公式3.2",
                "data": "$\\frac{(\\text{本期年报（半年报）报告期末对外担保余额}-\\text{本期年报（半年报）报告期初对外担保余额})}{\\text{往期年报所有者权益金额}} > 50\\%$",
            },
        ],
    },
    "一致性比对": {
        "description": "1.本期报告中的信息披露实物负责人姓名、会计师事务所名称、发行人的财务负责人与最近的定期报告中信息一致\n2.用户选中提取字段后，可通过操作栏画框重新提取答案，重新提取成功后需删除AI推荐答案",
        "formula": [],
    },
}

RULE_INFO = {
    "上交所企业债": CORPORATE_BOND_RULE,
    "深交所企业债": CORPORATE_BOND_RULE,
}
