SYNONYM_WORDS = [
    ["上市公司非公开发行股票", "定增", "上市公司非公开发行或交易的股票"],
    ["债券", "固定收益类品种", "债券回购"],
    ["收益凭证"],
    ["股票", "二级市场投资", "科创板股票", "科创板"],
    ["公募基金", "公开募集的证券投资基金"],
    ["期货投资", "期货"],
    ["国债期货"],
    ["商品期货"],
    ["场内期权", "股票期权"],
    ["收益互换"],
    ["场外期权"],
    ["融资融券"],
    ["港股通", "沪港通", "深港通"],
    ["转融通证券出借", "证券转融通", "将持有的证券作为融券标的出借给证券金融公司"],
    ["特殊投资品种", "私募基金", "资产管理计划", "私募证券投资基金", "资产管理产品", "资管计划"],
    ["存托凭证"],
    ["QDII"],
    ["新三板", "全国中小企业股份转让系统已挂牌的企业股票"],
    ["非上市公司的股权", "未上市企业股权"],
    ["股权类资产管理计划", "股权类资产管理产品"],
]

TITLE_FILE_TYPE = (".docx", ".pdf")
CLEAN_FILE_TYPE = (".doc", ".docx")
ALLOWED_FILE_TYPE = (*CLEAN_FILE_TYPE, ".pdf")
