import re

CHAPTER_DELAY_RISK = {  # 章节 十八、风险揭示->（二）一般风险揭示->4、流动性风险->（6）基金提前结束或延期结束的风险；
    "chapters": [
        re.compile(r"^[(（]?[一二三四五六七八九十]*[、）]*风险揭示$"),
        re.compile(r"^[(（]?[一二三四五六七八九十]*[、）]*基金提前结束(?:和|以?及|的|或)?延期结束的风险$"),
    ],
    "miss_detail": {"reason_text": "未找到第十八章中的终止条款", "miss_content": "《基金提前结束或延期结束的风险》"},
    "range": {
        "chapters": [
            re.compile(r"风险揭示$"),
        ],
        "start": [
            re.compile(r"基金合同的?终止的?情形(?:包括下列事项[:：]?)?$"),
        ],
        "end": [
            re.compile(r"(?:基金合同的展期|提取结束或延期结束的风险|技术风险|操作风险|信用风险|.{,20}风险)$"),
        ],
    },
}

CHAPTER_FUND_CLEARING = {  # 章节 十九、基金合同的效力、变更、解除与终止->（五）基金合同终止的情形
    "chapters": [
        re.compile(r"^[(（]?[一二三四五六七八九十]*[、）]*基金合同的(?:(?:效力|变更|解除|终止)[、与和]?)+$"),
        re.compile(r"^[(（]?[一二三四五六七八九十]*[、）]*基金合同终止的?情形$"),
    ],
    "miss_detail": {
        "reason_text": "未找到十九章中的终止条款",
        "miss_content": "《当事人权力和义务》->《基金合同终止的情形》",
    },
    "range": {
        "chapters": [
            re.compile(r"基金合同的(?:(?:效力|变更|解除|终止)[、与和]?)+$"),
            re.compile(r"基金合同终止的?情形$"),
        ],
        "start": [
            re.compile(r"基金合同的终止情形(?:包括下列事项[:：]?)?$"),
        ],
        "end": [
            re.compile(r"(?:基金合同的展期|提取结束或延期结束的风险|技术风险|操作风险|信用风险|.{,20}风险)$"),
        ],
    },
}


CHAPTERS_WITH_TEMPLATES = [
    # {
    #     "label": "template_28",
    #     "related_name": "基金合同终止的情形",
    #     "name": "基金合同终止的情形",
    #     "from": "20150424 中华人民共和国证券投资基金法（主席令第23号  2015年4月24日修订）",
    #     "origin": [
    #         "有下列情形之一的，基金托管人职责终止：",
    #         "（一）被依法取消基金托管资格；",
    #         "（二）被基金份额持有人大会解任；",
    #         "（三）依法解散、被依法撤销或者被依法宣告破产；",
    #         "（四）基金合同约定的其他情形。",
    #         "《20230928 私募投资基金备案指引第1号——私募证券投资基金（中国基金业协会 2023年9月28日）》",
    #         "第二十三条 私募证券基金存在下列情形之一的，应当进行清算：",
    #         "（一）	存续期届满且不展期的；",
    #         "（二）	发生基金合同约定应当终止的情形的；",
    #         "（三）	经投资者、私募基金管理人、私募基金托管人协商一致决定终止基金合同的；",
    #         "（四）	法律、行政法规、中国证监会和协会规定的其他情形。",
    #         "私募证券基金完成清算，剩余基金财产可以以货币资金方式分配给投资者，或者经投资者同意，以实物资产方式分配给投资者。",
    #     ],
    #     "right": {
    #         "chapter": CHAPTER_DELAY_RISK,
    #         "miss_detail": {
    #             "reason_text": "未找到十八章中的终止条款",
    #             "miss_content": "十八章终止条款与法规",
    #         },
    #         "templates": [
    #             # {
    #             #     "name": "法规",
    #             #     "content_title": "法规条款",
    #             #     "diff_text": "十八章中的终止条款与法规不一致",
    #             #     "items": [
    #             #         "基金托管人被依法取消证券投资基金托管资格；",
    #             #         "基金托管人依法解散、被依法撤销或被依法宣告破产的；",
    #             #         "经全体基金委托人、基金管理人和基金托管人协商一致决定终止的；",
    #             #         "基金合同期限届满而未延期；",
    #             #         "经基金份额持有人大会决定更换管理人或托管人；",
    #             #         "基金业协会撤销本基金备案的；",
    #             #     ],
    #             # },
    #             {
    #                 "name": "范文",
    #                 "content_title": "合同范文",
    #                 "diff_text": "十八章中的终止条款与范文不一致",
    #                 "items": [
    #                     "基金托管人被依法取消证券投资基金托管资格；",
    #                     "基金托管人依法解散、被依法撤销或被依法宣告破产的；",
    #                     "经全体基金委托人、基金管理人和基金托管人协商一致决定终止的；",
    #                     "基金份额持有人大会决定终止；",
    #                     "基金合同期限届满而未延期；",
    #                     "基金管理人、基金托管人职责终止，在六个月内没有新基金管理人、新基金托管人承接；",
    #                     "经基金份额持有人大会决定更换管理人或托管人；",
    #                     "本基金持有人全部赎回本基金所有份额的；",
    #                     "基金业协会撤销本基金备案的；",
    #                 ],
    #             },
    #         ],
    #     },
    #     "left": {
    #         "chapter": CHAPTER_FUND_CLEARING,
    #         "miss_detail": {
    #             "reason_text": "未找到十九章中的终止条款",
    #             "miss_content": "十九章终止条款与法规",
    #         },
    #         "templates": [
    #             # {
    #             #     "name": "法规",
    #             #     "content_title": "法规条款",
    #             #     "diff_text": "十九章中的终止条款与法规不一致",
    #             #     "items": [
    #             #         "基金托管人被依法取消证券投资基金托管资格；",
    #             #         "基金托管人依法解散、被依法撤销或被依法宣告破产的；",
    #             #         "经全体基金委托人、基金管理人和基金托管人协商一致决定终止的；",
    #             #         "基金合同期限届满而未延期；",
    #             #         "经基金份额持有人大会决定更换管理人或托管人；",
    #             #         "基金业协会撤销本基金备案的；",
    #             #     ],
    #             # },
    #             {
    #                 "name": "范文",
    #                 "content_title": "合同范文",
    #                 "diff_text": "十九章中的终止条款与范文不一致",
    #                 "items": [
    #                     "基金托管人被依法取消证券投资基金托管资格；",
    #                     "基金托管人依法解散、被依法撤销或被依法宣告破产的；",
    #                     "经全体基金委托人、基金管理人和基金托管人协商一致决定终止的；",
    #                     "基金份额持有人大会决定终止；",
    #                     "基金合同期限届满而未延期；",
    #                     "基金管理人、基金托管人职责终止，在六个月内没有新基金管理人、新基金托管人承接；",
    #                     "经基金份额持有人大会决定更换管理人或托管人；",
    #                     "本基金持有人全部赎回本基金所有份额的；",
    #                     "基金业协会撤销本基金备案的；",
    #                 ],
    #             },
    #         ],
    #     },
    # }
]
